package ex03_전보라;

public class Ex03 {
	//기능 : 정수 배열에서 최대값과 최소값을 출력하는 메소드
	//리턴타입 : void
	//메소드명 : printMinMax
	//매개변수 : int[] 
	//구현부
	//{
	//	if(매개변수로 전달받은 정수형 배열 값이 null 일 경우){
	//		전달받은 값이 없습니다 출력
	//		return; //메소드 끝
	//	}
	//	if(매개변수로 전달받은 정수형 배열의 길이가 0 일 경우){
	//		전달받은 값이 없습니다 출력
	//		return; //메소드 끝
	//	}
	//
	//	정수형 변수 두개 선언 -> int min, max;
	//	정수형 변수 두개에 매개변수로 전달받은 정수형배열의 0번째 값 대입
	//
	//	for(int i = 0; i < 매개변수로 전달받은 정수형 배열의 길이; i++) //반복문 사용하여 정수형 배열 길이만큼 반복
	//	{
	//		if(max < 정수형배열매개변수[i]){ //매개변수로 전달받은 정수형 배열의 i번째 값이 max 보다 클 경우
	//			max = 정수형배열매개변수[i];	//max 변수에 매개변수로 전달받은 정수형 배열의 i번째 값 대입
	//		}
	//		if(min > 정수형배열매개변수[i]){	//매개변수로 전달받은 정수형 배열의 i번째 값이 min 보다 작을 경우
	//			min = 정수형배열매개변수[i];	//min 변수에 매개변수로 전달받은 정수형 배열의 i번째 값 대입
	//		}
	//	}
	//	
	//	min, max 변수의 값 출력
	//}
	
	public static void main(String[] args) {
//		문제 3. 정수 배열에서 최대값과 최소값을 출력하는 메소드를 작성하려고한다. (20점)
//		코드 작성없이 한글로 로직구성만 하되, 메소드 정의 방법에 따라 순서 맞춰 작성하세요.
		
		// Ex03 클래스타입의 변수를 선언하고, new 키워드를 사용하여 Ex03 클래스의 객체를 생성하여 대입
		// Ex03 클래스의 객체의 printMinMax 메소드 호출하며, 인수로 정수형 배열 전달
	}
}
