package day09;

public class MethodTaskRe {

	//기능 : 음수를 양수로, 양수를 음수로 바꿔주는 메소
	//리턴타입: int
	//매개변수 : int
	//메소드명 : changeSign
	//구현부 : 
	//{
	//		return 매개변수 * -1;
	//}
	
	//기능 : 이름과 정수를 받아와서 정수만큼 이름을 출력하는 메소드
	//매개변수 : String, int
	//리턴타입 : String
	//메소드명 : printName
	//구현부 : 
	//{
	//	String 반환할변수 = "";
	//	for(int i = 0; i < 정수형매개변수; i++) //정수형매개변수만큼 반복
	//	{
	//		반환할변수 += String매개변수;
	//	}
	//	return 반환할변수;
	//}
	
	public static void main(String[] args) {
		// 1. 음수를 양수로, 양수를 음수로 바꿔주는 메소드
		// 매개변수o, 리턴값o
		// 메소드명 : changeSign
		
		// 2. 이름과 정수를 받아와서 정수만큼 이름을 출력하는 메소드
		// 매개변수o, 리턴값o
		// 메소드명 : printName
		
		// 3. 10이하의 숫자는 1로 10을 초과하는 숫자는 100으로 반환하는 메소드
		// 매개변수o, 리턴값o
		// 메소드명 : changeNumber
		
		// 4. 5개의 정수 중 평균을 반환하는 메소드
		// 매개변수o(배열), 리턴값o
		// 메소드명 : getAvg
		
		// 5. 정수 배열 중 최대값과 최소값을 출력하는 메소드
		// 매개변수o(배열), 리턴값x
		// 메소드명 : printMinMax
		
		// 6. 소문자는 대문자로, 대문자는 소문자로 바꿔주는 메소드
		// 예시 ) BanAnA => bANaNa
		// 메소드명 : changeCase
		// 매개변수와 반환값은 자유 => 단, 형변환 이용할것!
		
		// 7. 아이디와 비밀번호를 입력받아 로그인하기
		// 매개변수o 리턴값o(리턴타입 boolean)
		// 메소드명 : login
		// main 메소드에서 id가 admin이고 비밀번호가 1234이면 관리자님 환영합니다 출력
		// 둘중하나라도 틀리면 다시 확인하세요 출력
	}
}
